#include <locale.h>
#include <stdio.h>
void name()
{
	setlocale(LC_ALL, "RUS");
	puts("* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *");
	puts("*  Лабораторная работа - Написание и компиляция консольного       *");
	puts("*     приложения в среде разработки MVS 2022                      *");
	puts("*                                                                 *");
	puts("*    Выполнил: Сидоров А.С.                                       *");
	puts("*    Группа: бИПТ-252                                             *");
	puts("* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *");
	puts("                                                                   ");
	
	return 0;
}
void date()
{
	setlocale(LC_ALL, "RUS");
	puts("* * * * * * * * * * * * * * * * * * * * * *");
	puts("*                   ___      ___    ___   *");
	puts("*    |  |   |   |      |    |   |  |      *");
	puts("*    |  |___|   |   ___|    |   |  |___   *");
	puts("*    |      |   |   |       |   |     |   *");
	puts("*    |      | . |   |___  . |___|  ___|   *");
	puts("*                                         *");
	puts("* * * * * * * * * * * * * * * * * * * * * *");
	
	return 0;
}
void main()
{
	name();
	date();
}